#!/usr/bin/env python3
# encoding:utf-8
'''
@author: lierl
@file: province_city.py
@time: 2018/3/30 9:43
'''
__author__ = 'lierl'


dict_db = {
    "河南": [
        {
            "郑州": [
                "中原区",
                "金水区",
                "二七区",
                "上街区",
                "巩义市",
                "新郑市",
                "新密市",
                "登封市",
                "荥阳市",
                "中牟县"
            ]
        },
        {
            "开封": [
                "鼓楼区",
                "龙亭区",
                "禹王台区",
                "金明区",
                "开封县",
                "尉氏县",
                "兰考县",
                "杞县",
                "通许县"
            ]
        },
        {
            "南阳": [
                "卧龙区",
                "宛城区",
                "邓州市",
                "桐柏县",
                "方城县",
                "淅川县",
                "镇平县",
                "唐河县",
                "南召县",
                "内乡县"
            ]
        },
        {
            "洛阳": [
                "西工区",
                "老城区",
                "涧西区",
                "瀍河回族区",
                "洛龙区",
                "吉利区",
                "偃师市",
                "孟津县",
                "汝阳县"
            ]
        }
    ],
    "湖南": [
        {
            "长沙": [
                "岳麓区",
                "芙蓉区",
                "天心区",
                "开福区",
                "雨花区",
                "浏阳市",
                "长沙县"
            ]
        },
        {
            "岳阳": [
                "岳阳楼区",
                "云溪区",
                "君山区",
                "临湘市",
                "汨罗市",
                "岳阳县"
            ]
        },
        {
            "株洲": [
                "天元区",
                "荷塘区",
                "芦淞区",
                "石峰区",
                "醴陵市",
                "株洲县",
                "炎陵县"
            ]
        },
        {
            "湘潭": [
                "岳塘区",
                "雨湖区",
                "湘乡市",
                "韶山市",
                "湘潭县"
            ]
        }
    ],
    "广东": [
        {
            "广州": [
                "越秀区",
                "荔湾区",
                "海珠区",
                "天河区",
                "白云区",
                "黄埔区",
                "番禺区",
                "花都区"
            ]
        },
        {
            "深圳": [
                "福田区",
                "罗湖区",
                "南山区",
                "宝安区",
                "龙岗区",
                "盐田区"
            ]
        },
        {
            "珠海": [
                "香洲区",
                "斗门区",
                "金湾区"
            ]
        }
    ]
}